DataProcessors/РазбиениеННПоСумме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РазбиениеННПоСумме</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТК_НалоговаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерхнийПорог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НижнийПорог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/РазбиениеННПоСумме/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура РазбитьНаСервере1(Документ, ВерхнийПорог, НижнийПорог) Экспорт
	
ФормаОбъекта = Документ.ПолучитьФорму();
	ТаблицаТовары = Документ.Товары;
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Если НижнийПорог >= ТаблицаТовары.Итог("СуммаВсего") Тогда
		Сообщить("Сумма Налоговой и так меньше порога, разбивать незачем !!!");
		Возврат
	ИначеЕсли ТаблицаТовары.Количество()=1 И (ТаблицаТовары[0].Количество=1 Или НижнийПорог<ТаблицаТовары[0].Цена) Тогда
		Сообщить("Разбивка автоматически невозможна ! Попробуйте разбить вручную !!!");
		Возврат
	КонецЕсли;
	
	КопияТовары = ТаблицаТовары.Выгрузить();
	СуммаДокумента = 0;
	СуммаНакладных = 0;
	Попытка
		НачатьТранзакцию();
		
		ОбъектНН = ФормаОбъекта.Скопировать();
		ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
		ОбъектНН.УстановитьНовыйНомер();
		ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
		ОбъектНН.Товары.Очистить();
		
		Для Каждого стрТТНН Из КопияТовары Цикл
			ПорогСуммы = ГСЧ.СлучайноеЧисло(НижнийПорог, ВерхнийПорог); 
			
			НоваяСтрока = ОбъектНН.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТТНН);
			СуммаДокумента = СуммаДокумента + НоваяСтрока.СуммаВсего;
			
			Если ПорогСуммы<=СуммаДокумента Тогда
				Пока ПорогСуммы<=СуммаДокумента Цикл
					НужноеКоличество = Цел((ПорогСуммы-СуммаДокумента+НоваяСтрока.СуммаВсего)/(НоваяСтрока.СуммаВсего/НоваяСтрока.Количество));
					ОстатокКоличества = НоваяСтрока.Количество - НужноеКоличество;
					Цена = НоваяСтрока.Цена;
					Если НужноеКоличество > 0 Тогда 
						НоваяСтрока.Количество = НужноеКоличество;	
						ОбъектНН.ОбработкаРеквизита("Товары.Количество",НоваяСтрока,ФормаОбъекта);
					Иначе
						Если ОбъектНН.Товары.Количество()=1 И ПорогСуммы<Цена Тогда
							Сообщить("Т.к цена позиции больше порога, строку не дробим !!!");
							ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
							Сообщить(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
							СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
							Если КопияТовары.Индекс(стрТТНН) <> КопияТовары.Количество()-1 Тогда
								СуммаДокумента = 0;
								ОбъектНН = ФормаОбъекта.Скопировать();
								ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
								ОбъектНН.УстановитьНовыйНомер();
								ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
								ОбъектНН.Товары.Очистить();
							КонецЕсли;
							Прервать;
						Иначе
							ОбъектНН.Товары.Удалить(НоваяСтрока);
						КонецЕсли;
					КонецЕсли;
					ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
					Сообщить(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
					СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
					
					ОбъектНН = ФормаОбъекта.Скопировать();
					ОбъектНН.Дата = ФормаОбъекта.Ссылка.Дата;
					ОбъектНН.УстановитьНовыйНомер();
					ОбъектНН.Комментарий = "Создан разбиением из '"+Документ+"'";
					ОбъектНН.Товары.Очистить();
					НоваяСтрока = ОбъектНН.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТТНН);
					НоваяСтрока.Количество = ОстатокКоличества;	
					НоваяСтрока.Цена = Цена;	
					ОбъектНН.ОбработкаРеквизита("Товары.Количество",НоваяСтрока,ФормаОбъекта);
					СуммаДокумента = НоваяСтрока.СуммаВсего;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		Если Не ЗначениеЗаполнено(ОбъектНН.Ссылка) Тогда
			ОбъектНН.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить(Строка(ОбъектНН)+" на сумму "+Формат(ОбъектНН.СуммаДокумента,"ЧДЦ=2"));
			СуммаНакладных = СуммаНакладных + ОбъектНН.СуммаДокумента;
		КонецЕсли;
		
		НН = ФормаОбъекта.Ссылка.ПолучитьОбъект();
		НН.ПометкаУдаления = Истина;
		НН.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ЗафиксироватьТранзакцию();
		Сообщить("Обработка завершена !  "+Формат(НН.СуммаДокумента,"ЧДЦ=2")+" и "+Формат(СуммаНакладных,"ЧДЦ=2"));
	Исключение
		ОтменитьТранзакцию();
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	

КонецПроцедуры


&НаКлиенте
Процедура Разбить(Команда)
	
	РазбитьНаСервере1(Объект.Документ, Объект.ВерхнийПорог, объект.НижнийПорог);
КонецПроцедуры
